//COBOL    EXEC IGYWCL,MBR=CRIALUNO
//CBLRUN   EXEC PGM=CRIALUNO
//STEPLIB  DD   DSN=&SYSUID..LOAD,DISP=SHR
//RECIN1   DD   DSN=&SYSUID..SOURCE(NOMES),DISP=SHR
//RECIN2   DD   DSN=&SYSUID..SOURCE(SNOMES),DISP=SHR
//RECOUT   DD   DSN=&SYSUID..SOURCE(CADALUNO),DISP=SHR
//CEEDUMP  DD   DUMMY
