       IDENTIFICATION DIVISION.
       PROGRAM-ID.    PGM1.
       AUTHOR.        SOLANGE.
       DATE-WRITTEN.  17/09/2010.
      *
      * CÁLCULO DO PESO IDEAL E IMC
      *
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.  DECIMAL-POINT IS COMMA.

       DATA    DIVISION.
       WORKING-STORAGE SECTION.
       01  DADOS-ENTRADA.
           05 NOME PIC X(10).
           05 SEXO PIC X(01).
           05 PESO PIC ZZ9,99.
           05 ALT  PIC 9,99.
       01  LINHA   PIC X(80) VALUE ALL "Í".
       01  RESP    PIC X(01) VALUE SPACE.
       01  DADOS-CALCULO.
           05 PESO-CALC    PIC 9(03)V99 VALUE ZEROS.
           05 ALT-CALC     PIC 9V99     VALUE ZEROS.
           05 IMC-CALC     PIC 99V99    VALUE ZEROS.
           05 PIDEAL-CALC  PIC 9(03)V99 VALUE ZEROS.
       01  DADOS-SAIDA.
           05 IMC-SAIDA    PIC Z9,99.
           05 PIDEAL-SAIDA PIC ZZ9,99.
       PROCEDURE DIVISION.
       PRINCIPAL.
       PERFORM PROGRAMA UNTIL RESP = "N" OR "n"
       STOP RUN.
       
       PROGRAMA.
       PERFORM MONTA-TELA
       PERFORM ENTRA-DADOS
       PERFORM CALCULOS
       PERFORM MOSTRA-RESULTADOS.
       MONTA-TELA.
           DISPLAY ERASE
           DISPLAY LINHA AT 0101 WITH FOREGROUND-COLOR 15
           DISPLAY "ACADEMIA  MACK-FIT - CALCULO DO IMC" AT  0223
           WITH FOREGROUND-COLOR 3
       DISPLAY LINHA AT 0301 WITH FOREGROUND-COLOR 15
       DISPLAY "NOME..: " AT 0710 WITH FOREGROUND-COLOR 3
       DISPLAY "SEXO..: " AT 0910 WITH FOREGROUND-COLOR 3
       DISPLAY "PESO..: " AT 1110 WITH FOREGROUND-COLOR 3
       DISPLAY "ALTURA: " AT 1310 WITH FOREGROUND-COLOR 3.
       ENTRA-DADOS.
       INITIALIZE DADOS-ENTRADA
           ACCEPT NOME AT 0718 WITH FOREGROUND-COLOR 15 PROMPT
           ACCEPT SEXO AT 0918 WITH FOREGROUND-COLOR 15 AUTO-SKIP UPPER
           ACCEPT PESO AT 1118 WITH FOREGROUND-COLOR 15 EMPTY-CHECK
           ACCEPT ALT  AT 1318 WITH FOREGROUND-COLOR 15 EMPTY-CHECK
           DISPLAY "TECLE <ENTER> PARA RESULTADOS" AT 1550
           WITH FOREGROUND-COLOR 3
       STOP " ".
       CALCULOS.
       MOVE PESO TO PESO-CALC
       MOVE ALT  TO ALT-CALC
          COMPUTE IMC-CALC = PESO-CALC / (ALT-CALC ** 2)
          IF  SEXO = "F"
              COMPUTE PIDEAL-CALC = 62,1 * ALT-CALC - 44,7
          ELSE
          COMPUTE PIDEAL-CALC = 72,7 * ALT-CALC - 58
          END-IF.
       MOSTRA-RESULTADOS.
       DISPLAY ERASE
       DISPLAY LINHA AT 0101 WITH FOREGROUND-COLOR 15
       DISPLAY "ACADEMIA  MACK-FIT - RESULTADOS" AT  0226
               WITH FOREGROUND-COLOR 3
       DISPLAY LINHA AT 0301 WITH FOREGROUND-COLOR 15
       DISPLAY "NOME......: " AT 0710 WITH FOREGROUND-COLOR 3
       DISPLAY "PESO IDEAL: " AT 0910 WITH FOREGROUND-COLOR 3
       DISPLAY "IMC.......: " AT 1110 WITH FOREGROUND-COLOR 3
       DISPLAY NOME AT 0722 WITH FOREGROUND-COLOR 15
       MOVE PIDEAL-CALC TO PIDEAL-SAIDA
       DISPLAY PIDEAL-SAIDA AT 0922 WITH FOREGROUND-COLOR 15
       MOVE IMC-CALC TO IMC-SAIDA
       DISPLAY IMC-SAIDA AT 1122 WITH FOREGROUND-COLOR 15
       EVALUATE TRUE
       WHEN IMC-CALC < 18,5 DISPLAY " - ABAIXO DO PESO" AT 1127
            WITH FOREGROUND-COLOR 14
       WHEN IMC-CALC >= 18,5 AND <= 24,9
            DISPLAY " - NORMAL" AT 1127
            WITH FOREGROUND-COLOR 2
       WHEN IMC-CALC >= 25 AND <= 29,9
            DISPLAY " - ACIMA DO PESO" AT 1127
            WITH FOREGROUND-COLOR 14
       WHEN IMC-CALC >= 30  DISPLAY " - OBESO" AT 1127
            WITH FOREGROUND-COLOR 4
       END-EVALUATE
       MOVE SPACES TO RESP
       PERFORM UNTIL RESP = "S" OR "N"
       DISPLAY "OUTRO CALCULO? (S/N)" AT 1550
              WITH FOREGROUND-COLOR 3
       ACCEPT RESP AT 1571 WITH FOREGROUND-COLOR 15
       END-PERFORM.
     
